<h1>Prefix dan Alias</h1>

Mari kita belajar memahami prefix dan alias yang sebagai berikut ini:
1. Prefix, dimana kita akan menambahkan nama tabel di depan nama kolom.
2. Alias, dimana kita memberikan alias atau nama lain untuk tabel maupun kolom.

Sebagai contoh:

```sql
SELECT tab.column_name1 AS col1, tab.column_name2 FROM table_name AS tab
```

Ingat, bahwa:
1. Prefix yang tulisan "tab"
2. Alias yang diawali AS

Peraturan dalam penulisan prefix pada nama kolom:

```sql
SELECT table_name.column_name FROM table_name
```

In [ ]:
# prefix
sql('SELECT orders.ship_postal_code FROM orders LIMIT 5;')

  ship_postal_code
0            51100
1            44087
2        05454-876
3            69004
4           B-6000

Peraturan dalam penulisan alias:

```sql
SELECT column_name AS column_1 FROM table_name
```

In [ ]:
# alias
sql('SELECT ship_postal_code AS postal FROM orders LIMIT 5;')

      postal
0      51100
1      44087
2  05454-876
3      69004
4     B-6000

Selalu ada cara mengatasi AS dengan menghilangkan tulisan AS, sebagai berikut ini:

```sql
SELECT column_name column_1 FROM table_name
```

In [ ]:
# alias
sql('SELECT ship_postal_code postal FROM orders LIMIT 5;')

      postal
0      51100
1      44087
2  05454-876
3      69004
4     B-6000

Apakah hasil ini?

```sql
SELECT * AS column_1 FROM table_name
```

In [ ]:
# Tulis disini ya!

Peraturan dalam penggabungan prefix dan alias

```sql
SELECT table_name.column_name AS col1 FROM table_name
```

In [ ]:
# prefix dan alias
sql('SELECT orders.ship_postal_code AS postal FROM orders LIMIT 5;')

      postal
0      51100
1      44087
2  05454-876
3      69004
4     B-6000

Peraturan perubahan alias tabel

```sql
SELECT column_name FROM table_name AS tab1 
```

In [ ]:
# table1
sql('SELECT t1.ship_postal_code FROM orders AS t1 LIMIT 5;')

  ship_postal_code
0            51100
1            44087
2        05454-876
3            69004
4           B-6000

Peraturan perubahan alias tabel dan column

```sql
SELECT tab1.column_name AS col1 FROM table_name AS tab1 
```

In [ ]:
sql('SELECT t1.ship_postal_code AS postal FROM orders AS t1 LIMIT 5;')

      postal
0      51100
1      44087
2  05454-876
3      69004
4     B-6000

**Kesimpulan**

1. Penulisan lengkap untuk nama kolom adalah prefix berupa nama tabel disertai tanda titik sebelum nama kolom itu sendiri.
2. Alias adalah nama lain yang diberikan untuk kolom maupun tabel.
3. Alias dapat digunakan dengan keyword AS atau tanpa keyword AS setelah nama kolom dan tabel.
4. Prefix nama tabel bisa menggunakan alias.